/********************************************************************************/
/*																				*/
/*			リセット後の初期化 処理												*/
/*																				*/
/*			Cpu         :: PIC12F683											*/
/*			Language    :: PICC Lite											*/
/*			File Name   :: init.c												*/
/*																				*/
/********************************************************************************/
#include <pic.h>
#include <conio.h>

#include "pic12f683.h"

void			motor_init(void);
void			motor_out(unsigned char , unsigned char) ;
unsigned char	motor_flag(void);

/****************************************************************************/
/*																			*/
/*	モータ出力 初期化（Timer 2 & CCP1 使用）								*/
/*																			*/
/****************************************************************************/
void motor_init()
{
	CH_T2CON   = 0b00000000 ;	/* Timer2を一旦 未使用にする					*/
	CH_CCP1CON = 0b00000000 ;	/* CCP1を一旦 未使用にする						*/

// 周期：120μs ＝ (PR2＋1)×{1÷(内部ｸﾛｯｸ8MHz÷4)}
	CH_PR2     = 240-1 ;		/* PWM周期設定									*/
	CH_CCPR1L  = 0 ;			/* PWM出力 上位8Bitｸﾘｱ							*/
	CH_CCP1CON &= ~0x30 ;		/* PWM出力 下位2Bitｸﾘｱ							*/
	BI_TRISIO2  = 0 ;			/* GP2(PWM)を出力に設定							*/

	CH_T2CON   = 0b00000100 ;	/*Bit7:        :-:								*/
								/*Bit6:TOUTPS3 :0:ﾎﾟｽﾄｽｹｰﾙ 1:1					*/
								/*Bit5:TOUTPS2 :0:  〃							*/
								/*Bit4:TOUTPS1 :0:  〃							*/
								/*Bit3:TOUTPS0 :0:  〃							*/
								/*Bit2:TMR2ON  :1:ﾀｲﾏｰ2動作						*/
								/*Bit1:T2CKPS1 :0:ﾌﾟﾘｽｹｰﾗ 1						*/
								/*Bit0:T2CKPS0 :0:  〃							*/

	CH_CCP1CON = 0b00001100 ;	/*Bit7:        :-:								*/
								/*Bit6:        :-:								*/
								/*Bit5:DC1B1   :0:PWM LSB1						*/
								/*Bit4:DC1B0   :0:PWM LSB0						*/
								/*Bit3:CCP1M3  :1:PWMﾓｰﾄﾞ						*/
								/*Bit2:CCP1M2  :1:  〃							*/
								/*Bit1:CCP1M1  :0:x 〃							*/
								/*Bit0:CCP1M0  :0:x 〃							*/

}

/****************************************************************************/
/*																			*/
/*	モータ出力処理															*/
/*																			*/
/****************************************************************************/
void motor_out(unsigned char pwm_do , unsigned char pwm_out)
{
	CH_GPIO = pwm_do & 0x03 ;
	CH_CCPR1L = pwm_out ;
}

/****************************************************************************/
/*																			*/
/*	TMR2：PR2 コンペアマッチフラグ チェック処理								*/
/*																			*/
/****************************************************************************/
unsigned char motor_flag()
{
	unsigned char	wk ;

	if(BI_TMR2IF == 0){
		wk = 0 ;							/* コンペアマッチ無し			*/
	}else{
		wk = 1 ;							/* コンペアマッチ発生			*/
		BI_TMR2IF = 0 ;						/* フラグ クリア				*/
	}
	return(wk) ;
}
