/**********************************************************/
/*割り込み関数ライブラリ                                  */
/*2011.12.30                                              */
/**********************************************************/
#include "p33Fxxxx.h"
#include "interruptlib.h"

//****割り込み******************************************************************
//====外部割り込み0許可関数=====================================================
void ExternalInt0_Enable(int Mode, int Level)
{
	IFS0bits.INT0IF = 0;			//割り込み要求フラグクリア
	INTCON2bits.INT0EP = Mode;		//割り込みエッジ検出極性選択
	IPC0bits.INT0IP = Level;		//割り込み優先度
	IEC0bits.INT0IE = 1;			//外部割り込み0有効
}

//====外部割り込み1許可関数=====================================================
void ExternalInt1_Enable(int Mode, int Level)
{
	IFS1bits.INT1IF = 0;			//割り込み要求フラグクリア
	INTCON2bits.INT1EP = Mode;		//割り込みエッジ検出極性選択
	IPC5bits.INT1IP = Level;		//割り込み優先度
	IEC1bits.INT1IE = 1;			//外部割り込み1有効
}

//====外部割り込み2許可関数=====================================================
void ExternalInt2_Enable(int Mode, int Level)
{
	IFS1bits.INT2IF = 0;			//割り込み要求フラグクリア
	INTCON2bits.INT2EP = Mode;		//割り込みエッジ検出極性選択
	IPC7bits.INT2IP = Level;		//割り込み優先度
	IEC1bits.INT2IE = 1;			//外部割り込み2有効
}

//====外部割り込み0禁止関数=====================================================
void ExternalInt0_Disable()
{
	IEC0bits.INT0IE = 0;			//外部割り込み0無効
}

//====外部割り込み1禁止関数=====================================================
void ExternalInt1_Disable()
{
	IEC1bits.INT1IE = 0;			//外部割り込み1無効
}

//====外部割り込み2禁止関数=====================================================
void ExternalInt2_Disable()
{
	IEC1bits.INT2IE = 0;			//外部割り込み2無効
}


//****割り込み******************************************************************
//====割り込み許可関数==========================================================
void EnableInterrupt(void)
{
	//----CORCON:コア制御レジスタ-------------------------------------
	//CPU割り込み優先度のステータスビット3
	CORCONbits.IPL3 = 0;	//CPU割り込み優先度は7以下
	
	//----SR:CPU内ステータスレジスタ----------------------------------
	//CPU割り込み優先度ステータスレジスタ
	SRbits.IPL = 0;			//CPU割り込み優先度は0
	
	//----INTCON1:割り込み制御レジスタ--------------------------------
	//割り込みネスティングディスエーブルビット
	INTCON1bits.NSTDIS = 0;	//割り込みネスティングは有効
	
	//----INTCON2:割り込み制御レジスタ2-------------------------------
	//代替割り込みベクタテーブルイネーブルビット
	INTCON2bits.ALTIVT = 0;	//代替ベクタテーブルを使用しない
}

//====割り込み禁止関数==========================================================
void DisableInterrupt(void)
{
	//----CORCON:コア制御レジスタ-------------------------------------
	//CPU割り込み優先度のステータスビット3
	CORCONbits.IPL3 = 0;	//CPU割り込み優先度は7以下
	
	//----SR:CPU内ステータスレジスタ----------------------------------
	//CPU割り込み優先度ステータスレジスタ
	SRbits.IPL = 7;			//CPU割り込み優先度は7, ユーザー割り込み無効
	
	//----INTCON1:割り込み制御レジスタ--------------------------------
	//割り込みネスティングディスエーブルビット
	INTCON1bits.NSTDIS = 0;	//割り込みネスティングは有効
	
	//----INTCON2:割り込み制御レジスタ2-------------------------------
	//代替割り込みベクタテーブルイネーブルビット
	INTCON2bits.ALTIVT = 0;	//代替ベクタテーブルを使用しない
}
